#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
//写一段代码告诉我们当前机器的字节序(大小端)是什么
//int main()
//{
//	int a = 1;
//	char* p = (char*)&a;//char* 指针只访问一个字节
//	if (*p == 1)
//	{
//		printf("小端\n");
//	}
//	else
//		printf("大端\n");
//
//	return 0;
//}
//int sys_check(char* p)
//{
//	/*if (*p == 1)
//		return 1;
//	else
//		return 0;*/
//	return *p;
//}
//int main()
//{
//	int a = 1;
//	int num = 0;
//	char* p = (char*)&a;
//	num = sys_check(p);
//	if (num == 1)
//		printf("小端\n");
//	else
//		printf("大端\n");
//	return 0;
//}

//输出什么？
//int main()
//{
//	char a = -1;
//	//原码10000000 00000000 00000000 00000001
//	//反码11111111 11111111 11111111 11111110
//	//补码11111111 11111111 11111111 11111111 
//	//11111111(a里面存8个bit)
//	//a的整型提升11111111 11111111 11111111 11111111
//	signed char b = -1;
//	unsigned char c = -1;
//	//c的整型提升00000000 00000000 00000000 11111111
//	printf("a=%d,b=%d,c=%d", a, b, c);
//	return 0;
//}

//int main()
//{
//	char a = -128;
//	printf("%u\n", a);//%d->打印有符号十进制数 %u->打印无符号十进制数
//	return 0;
//}

//int main()
//{
//	int i = -20;
//	//i原码10000000 00000000 00000000 00010100
//	//i反码11111111 11111111 11111111 11101011
//	//i补码11111111 11111111 11111111 11101100
//	unsigned int j = 10;
//	//j补码00000000 00000000 00000000 00001010
//
//	//i+j补码11111111 11111111 11111111 11110110
//	//i+j反码11111111 11111111 11111111 11110101
//	//i+j原码10000000 00000000 00000000 00001010  ->-10
//	printf("%d\n", i + j);
//	return 0;
//}

//int main()
//{
//	unsigned int i;//无符号数永远位正数
//	for (i = 9; i >= 0; i--) {
//		printf("%u\n", i);
//	}
//	return 0;
//}

//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	printf("%d", strlen(a));//255
//	return 0;
//}

//int main()
//{
//	int n = 9;
//	//n的补码0 0000000 000000000000000000001001
//	float* pFloat = (float*)&n;
//	printf("n的值为：%d\n", n);//9
//	printf("*pFloat的值为：%f\n", *pFloat);//0.000000
//	//(-1)^0 * 0.000000000000000000001001 * 2^-126
//	*pFloat = 9.0;
//	//1001.0
//	//1.001*2^3
//	//(-1)^0 * 1.001 * 2^3
//	//0 10000010 000000000000000000
//	printf("num的值为：%d\n", n);
//	printf("*pFloat的值为：%f\n", *pFloat);
//	return 0;
//}